/* No comment provided by engineer. */
"Cancel" = "Annulla";

/* No comment provided by engineer. */
"Consortium myMed:" = "Consorzio myMed:"; /* NEW */

/* No comment provided by engineer. */
"Credits" = "Crediti";

/* No comment provided by engineer. */
"Error" = "Errore";

/* No comment provided by engineer. */
"Funded by:" = "Funded by:"; /* NEW */

/* No comment provided by engineer. */
"Help" = "Aiuto";

/* No comment provided by engineer. */
"Internet connection not available" = "Internet connection not available";

/* No comment provided by engineer. */
"myEdu" = "myEdu";

/* No comment provided by engineer. */
"myFSA" = "myFSA"; /* NEW */

/* No comment provided by engineer. */
"myMed Launchpad..." = "Launchpad myMed..."; /* NEW */

/* No comment provided by engineer. */
"MyMed web site..." = "Sito web myMed..."; /* NEW */

/* No comment provided by engineer. */
"New item" = "Nuovo elemento";

/* No comment provided by engineer. */
"Ok" = "Ok";

/* No comment provided by engineer. */
"Open web site" = "Aprire sito web";

/* No comment provided by engineer. */
"Please wait..." = "Attendere prego...";

/* No comment provided by engineer. */
"Please write the new checklist item" = "Inserire un nuovo elemento da ricordare";

/* No comment provided by engineer. */
"Reload" = "Reload"; /* NEW */

/* No comment provided by engineer. */
"Server down, or no connection available." = "Server down, or no connection available."; /* NEW */

/* No comment provided by engineer. */
"Social Network" = "Social Network";

/* No comment provided by engineer. */
"Suggest this app" = "Suggerisci questa app";

/* No comment provided by engineer. */
"To do" = "Da fare";

/* No comment provided by engineer. */
"Universities" = "Università";

